Documents/ВыплатаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВыплатаЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморассчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработанноеВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморассчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморассчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыплатаЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Расчет.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудников = РезультатЗапроса.Выгрузить();		
	
	//Цикл по всем сотрудникам
	Для Каждого СтрокаСотрудника из ВыборкаСотрудников Цикл
		
		Сотрудник = СтрокаСотрудника.Ссылка;
		Ставка = Сотрудник.ОплатаВЧас;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморассчетыССотрудникамиОстатки.ЧасыОстаток КАК ЧасыОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморассчетыССотрудниками.Остатки(, Сотрудник = &Сотрудник) КАК ВзаиморассчетыССотрудникамиОстатки";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ЧасыСотрудника = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЧасыСотрудника = ВыборкаДетальныеЗаписи.ЧасыОстаток + ЧасыСотрудника;	
		КонецЦикла;
	
		Если ЧасыСотрудника = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Расчет.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.Ставка = Ставка;
		НоваяСтрока.ОтработанноеВремя = ЧасыСотрудника;
		НоваяСтрока.Сумма = Ставка * ЧасыСотрудника;		
	КонецЦикла;
	
	
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
	
	Итог = Объект.Расчет.Количество();
	Если Итог = 0 Тогда
		Сообщить("Нет сотрудников для выплаты зарплаты");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасчетСтавкаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Ставка * ТекСтрока.ОтработанноеВремя;
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Ставка = ТекСтрока.Сумма / ТекСтрока.ОтработанноеВремя;
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
КонецПроцедуры
